Autodesk.Revit.DB.Document.SaveLocalSharedModel(System.Guid,System.Guid,System.String)
After execution, document will represent a local model whose central file resides in A360.
Remarks:
Assumes that worksharing has been enabled for this document and that user is currently signed in
to A360.
projectID:
Identifies the A360 project to which this model will be attached.
assignedModelGUID:
Identifies the model file on the server
modelName:
The name by which the model will be identified in A360.
Returns:
The guid that identifies the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Document.SaveCloudSharedModel(System.Guid,System.String,System.String)
After execution, central file resides in Forge DM.
Remarks:
Assumes that worksharing has been enabled for this document and that user is currently signed in
to C4R.
projectID:
Identifies the C4R project to which this model will be attached.
modelName:
The name by which the model will be identified in Forge DM.
folderId:
The folder ID input from Forge DM
Returns:
The guid that identifies the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
Could be for any of the reasons that SynchronizeWithCentral fails with CentralModelException, for example, a central model with that name
is already associated to the specified C4R project.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified C4R project.
Since:
2018

Autodesk.Revit.DB.Document.SaveCloudSharedModel(System.Guid,System.String)
After execution, central file resides in A360.
Remarks:
Assumes that worksharing has been enabled for this document and that user is currently signed in
to A360.
projectID:
Identifies the A360 project to which this model will be attached.
modelName:
The name by which the model will be identified in A360.
Returns:
The guid that identifies the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
Could be for any of the reasons that SynchronizeWithCentral fails with CentralModelException, for example, a central model with that name
is already associated to the specified A360 project.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified A360 project.
Since:
2015

Autodesk.Revit.DB.Document.SaveAsCloudSharedModel(System.Guid,System.String)
Enables A360 collaboration for this document. After execution, document will represent a local model
whose central file resides in A360.
Remarks:
Assumes that worksharing has been enabled for this document and that user is currently signed in
to A360.
projectID:
Identifies the A360 project to which this model will be attached.
modelName:
The name by which the model will be identified in A360.
Returns:
The guid that identifies the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
Could be for any of the reasons that SynchronizeWithCentral fails with CentralModelException, for example, a central model with that name
is already associated to the specified A360 project.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified A360 project.
Since:
2015

Autodesk.Revit.DB.Document.IsValidNameForCloudSharedModel(System.Guid,System.String)
Checks whether there is already a model with the specified name attached to the specified A360 project.
projectID:
Identifies the A360 project to which this model will be attached.
modelName:
The name by which the model will be identified in A360.
Returns:
True if there is not already a model with the specified name attached to the specified project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Document.SynchronizeWithCentral(Autodesk.Revit.DB.TransactWithCentralOptions,Autodesk.Revit.DB.SynchronizeWithCentralOptions)
Performs reload latest until the model in the current session is up to date and then saves changes back to central.
A save to central is performed even if no changes were made.
transactOptions:
Options to customize behavior accessing the central model.
syncOptions:
Options to customize behavior of SynchronizeWithCentral.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralFileCommunicationException:
The file-based central model could not be reached, because e.g. the network is down or the file server is down.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied due to lack of access privileges.
-or-
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Username does not match the one used to create the local file.
-or-
Revit could not save all of the worksets that have been changed.  Try again.
-or-
Some of the elements you changed in this model are now editable by someone else, or you checked out worksets that were at risk
or relinquished in the central model but not this file.  You cannot synchronize with the central model until the other user
relinquishes these elements without making changes.
-or-
The central model has been replaced by a local model.
-or-
Local incompatible because it was closed without saving after synchronizing with central.
-or-
The central model is missing.
-or-
The central model is incompatible.
-or-
The central model is corrupt or not an RVT file.
-or-
The central model was rolled back.
-or-
The central model's elements have been relinquished
-or-
Your data or permissions saving is aborted by another user.
-or-
The central model is overritten by other user.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
Cannot access the local file.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a primary document, it is a linked document.
-or-
This Document is read-only: It cannot be modified.
-or-
This Document has an open editing transaction and is accepting changes.
-or-
This Document has is in an edit mode or is in family mode.
-or-
Saving is not allowed in the current application mode.
-or-
This Document does not have a central location: Worksharing needs to be enabled and central model saved.
-or-
This Document is a local file that is not owned by the current user, who therefore is not allowed to modify it.
-or-
The local file is read-only.
It can not be saved before or after synchronizing with central.
-or-
Saving local before first reload latest and after saving changes to central
in Synchronize with Central is mandatory for server-based local models.
-or-
Operation is not permitted when there is any open sub-transaction, transaction, or transaction group.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Synchronize With Central was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be reached
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
The disk space is running low on server, please contact the server administrator.
-or-
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not sign in to Autodesk 360.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the specified A360 project.
Since:
2014

Autodesk.Revit.DB.Document.GetElement(Autodesk.Revit.DB.ElementId)
Gets the Element referenced by the input string name.
Remarks:
null will be returned if the input ElementId doesn't reference to a valid Element.
id:
The ElementId, whose referenced Element will be retrieved from the model.
Returns:
The element referenced by the input argument.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Document.GetWorksharingCentralModelPath
Gets the central model path of the worksharing model.
Returns:
The central model path, or null if the document is not workshared.
Since:
2013

Autodesk.Revit.DB.Document.IsModelInCloud
Identifies if document is located in cloud.
Since:
2015

Autodesk.Revit.DB.Document.Title
The document's title.
Remarks:
A title is usually derived from the document's filename.
Note that the title will be empty if a document is detached.  See Autodesk.Revit.DB.Document.IsDetached.

Autodesk.Revit.DB.Document.ProjectId
Returns a BIM 360 Team Project Id. (E.g. aa75029861073e)
Note no exception will be passed to caller when calling this API.

Autodesk.Revit.DB.Document.HubId
Returns a BIM 360 Team hub id. (E.g. https://wip1fqaautodesk123.staging.autodesk360beta.com)
Note no exception will be passed to caller when calling this API.

Autodesk.Revit.DB.Document.CentralModelUrn
Returns the WIPDM lineage URN of the C4R model. (E.g. urn:adsk.wipqa:dm.lineage:xxyXYZG1REmH0RNJwHSI4Q)
Note no exception will be passed to caller when calling this API.

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.View3D,Autodesk.Revit.DB.ViewPlan,Autodesk.Revit.DB.BuildingSiteExportOptions)
Exports the document in the format of Civil Engineering design applications.
folder: Output folder, into which file will be exported. The folder must exist.
name: The name for the exported civil file.
If null or empty, automatic naming will be used."
view: 3D View to be exported.
grossAreaPlan: All the areas on the view plan will be exported, it must be 'Gross Building' area plan. It must not be null.
To check whether its area scheme is Gross Building, use IsGrossBuildingArea property of Autodesk.Revit.DB.AreaScheme.
options: Various options applicable to the format of Civil Engineering design applications.
If null, all options will be set to their respective default values.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input view or grossAreaPlan is null
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when folder is null or empty.Thrown when name is not valid.Thrown when grossAreaPlan is not a valid element.Thrown when grossAreaPlan is not a Gross Building Area Plan.
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the folder does not exist
Returns: True if successful, otherwise False.